// 正则

/* 合法uri*/
// let urlregex = /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/
// urlregex.test(textval)

/* 小写字母*/
// let reg = /^[a-z]+$/
// reg.test(str)

/* 大写字母*/
// let reg = /^[A-Z]+$/

/* 大小写字母*/
// let reg = /^[A-Za-z]+$/

/*判断输入的EMAIL格式是否正确 */
// let reg = /[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?/

/*判断输入的手机号格式是否正确 */
// let reg = /^1[0-9]{10}$/

/* 是否手机号码或者固话*/
// let reg = /^((0\d{2,3}-\d{7,8})|(1[34578]\d{9}))$/

/* 是否固话*/
// let reg = /0\d{2}-\d{7,8}/;

/*验证价格*/
// let reg = /(^[1-9]([0-9]{1,4})?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/;

/*验证正整数*/
// let reg = /^[1-9][0-9]*$/;

/*验证4位正整数*/
// let reg = /^0|[1-9][0-9]{0,3}$/;

/*验证1-16位数字加2位小数*/
// let reg = /^(0|[1-9][0-9]{0,13})(\.[0-9]{1,2})?$/;

//校验输入非中文  true 是中文
// let reg = /[\u4e00-\u9fa5]/;

//校验输入是否是数字（包括正负、小数点）
// let reg = /[-+]*[0-9][.][0-9]+|[-+]*[1-9][0-9]*|^[0]$/;

//校验输入字符是否大于6位(包含数字字母)
// let reg = /^.{6,18}$/;

/* 是否邮箱*/
// let reg = /^([a-zA-Z0-9]+[-_\.]?)+@[a-zA-Z0-9]+\.[a-z]+$/;

/* 是否身份证号码*/
// let reg = /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/;

